package protocol_1

import akka.actor.typed.ActorSystem

// Θέλουμε να εκτυπώσουμε τη σειρά αριθμών 0, 1, 2, 3, 4, 5 …
// Για το σκοπό αυτό η διεργασία P παράγει στην διαμοιραζόμενη
// μεταβλητή sh την ανωτέρω σειρά αριθμών,
// ενώ η διεργασία Q εκτυπώνει την sh.
object ProtocolOne {
  //Για την υλοποίηση του συγκεκριμένου πρωτοκόλλου
  //θα δημιουργηθούν τρείς Actors:

  //-Ο πρώτος(Incrementer) θα έχει σαν μοναδική λειτουργία
  // την αύξηση του τρέχοντος αριθμόυ της σειράς.
  // Για να πετύχει αυτο, στο πρωτόκολλό του θα περιλαμβάνεται ενα είδος μηνύματος
  // που θα περιέχει τον τρέχον αριθμό προς αύξηση

  //-Ο δεύτερος(Printer) απλα θα εκτυπώνει την τρέχουσα τιμή της σειράς.
  // Για να πετύχει αυτο, στο πρωτόκολλό του θα περιλαμβάνεται ενα είδος μηνύματος
  // που θα περιέχει τον τρέχον αριθμό προς εκτύπωση

  //-Για την αρχικοποίηση του ActorSystem της εφαρμογής και την έναρξη της επικοινωνίας
  // των δυο παραπάνω actors θα χρησιμοποιθεί ένας απλός "main" actor(CommStarter),
  // ο οποίος θα στέλνει το μήνυμα με τον αρχικό αριθμό της σειράς στον Printer.

  def main(args: Array[String]): Unit =
    ActorSystem(CommStarter(), "CommStarter")
}
